app/Http/Controllers/RoleController.php

select * from `roles`
select * from `permissions`
---
    public function rolesPermissions()
    {
        $roles = Role::all();
        $permissions = Permission::all();