app/Http/Controllers/UserController.php

select * from `users` where (`name` like '%Ta%' or `email` like '%Ta%') and `users`.`deleted_at` is null limit 15 offset 0
select count(*) as aggregate from `users` where (`name` like '%Ta%' or `email` like '%Ta%') and `users`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null limit 20 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $searchUser = $request->input('search');
        if ($searchUser) {
            /**
             * If input field is not empty we'll perform search on out user table
             */
            $users = User::where('name', 'like', '%' . $searchUser . '%')->orWhere('email', 'like', '%' . $searchUser . '%')->paginate();
        } else {
            $users = User::paginate(20);

select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1
---
    public function show(string $id)
    {
        $user = User::findOrFail($id);